# -*- coding: utf-8 -*-
# Author: Mh
# Date: 2022/9/15 19:42
# Function:

# v1版本的dno映射表
# DNO_TYPE = {
#     1: '管段',
#     2: '调压站',  # 调压设备
#     3: '阀门',
#     4: '凝水缸',
#     5: '带气点',
#     6: '空节点',
#     7: '气源',  # 气源点
#     8: '流量计',
#     9: '检测点',
#     10: '民用户',
#     11: '工商户',
#     12: '节点',
#     13: '阴极保护设备'
# }

# v2版本的仿真类型的映射表
SIM_NODE_TYPE_MAP = {
    "800000": "普通节点",
    "800000.000001": "气源",
    "800000.000002": "用户",
    "800000.000003": "调压站",
    "800000.000004": "阀门",
    "800000.000005": "节点",
    "800000.000006": "管段",
}

SIM_NODE_TYPE_MAP_REVERSE = {value: key for key, value in SIM_NODE_TYPE_MAP.items()}

# 真实节点类型(前端页面展示使用)
NODE_TYPE_MAP = {
    "600000.000001": "渠道供应商",
    "600000.000002": "门站",
    "600000.000003": "LNG储气站",
    "600000.000004": "调压站",
    "600000.000005": "调压设备",
    "600000.000006": "工商户",
    "600000.000007": "企业户",
    "600000.000008": "堵头[管帽]",
    "600000.000009": "二通",
    "600000.000010": "三通",
    "600000.000011": "四通",
    "600000.000012": "管段",
    "600000.000013": "阀门",
    "600000.000014": "福利户",
    "600000.000015": "普通节点"
}

NODE_TYPE_MAP_REVERSE = {value: key for key, value in NODE_TYPE_MAP.items()}

GAS_COMPOSE = ['ch4', 'c2h6', 'c3h8', 'n_c4h10', 'i_c4h10', 'i_c5h12', 'n_c5h12', 'c5h12', 'n2', 'co2', 'c6h14']

# 标准化压力字典
STANDARD_PRESSURE_DICT = {
    "200000": "未知",  # 数据库为空
    "200000.000001": "超高压",
    "200000.000002": "高压A",
    "200000.000003": "高压B",
    "200000.000004": "中压A",
    "200000.000005": "中压B",
    "200000.000006": "次高压A",
    "200000.000007": "次高压B",
}
# 标准化材质字典
STANDARD_MATERIAL_DICT = {
    "220000": "PE",  # 数据库为空
    "220000.000001": "螺旋焊接钢管",
    "220000.000002": "无缝钢管",
    "220000.000003": "PE",
    "220000.000004": "直缝焊接钢管",
}
